app/Controllers/Admin/Bairros.php

SELECT *
FROM `bairros`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `bairros`
---
    public function index(){
        $data = [
            'titulo' => 'Listando os bairros atendidos',
            'bairros' => $this->bairroModel->withDeleted(true)->paginate(10),

UPDATE `bairros` SET `valor_entrega` = '12.00', `atualizado_em` = '2022-05-26 02:23:37'
WHERE `bairros`.`id` IN ('1')
---
    public function atualizar($id = null){

        if($this->request->getMethod() === 'post'){
            $bairro = $this->buscaBairroOu404($id);

            if($bairro->deletado_em != null){
                return redirect()
                        ->back()
                        ->with('info', "O bairro $bairro->nome encontra-se excluída no momento. Portanto, não é possível editá-lo");
            }

            $bairro->fill($this->request->getPost());

            $bairro->valor_entrega = str_replace(",", "", $bairro->valor_entrega);

            if(!$bairro->hasChanged()){
                return redirect()->back()->with('info', 'Nenhum dado foi modificado');
            }

            if($this->bairroModel->save($bairro)){