app/Controllers/Admin/Categorias.php

SELECT *
FROM `categorias`
WHERE `id` = 4
GROUP BY `categorias`.`id`
ORDER BY `categorias`.`id` ASC
 LIMIT 1
---
    private function buscaCategoriaOu404(int $id = null){
        if(!$id || !$categoria = $this->categoriaModel->withDeleted(true)->where('id', $id)->first()){