app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
 LIMIT 6, 6
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
---
    public function index(){

        $data=[
            'titulo' => 'Listando os usuarios',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(6),

SELECT *
FROM `usuarios`
WHERE `id` = 1
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1
---
    private function buscaUsuarioOu404(int $id = null){
        if(!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()){