app/Models/ProdutoModel.php

SELECT `produtos`.`id`, `produtos`.`nome`, `produtos`.`slug`, `produtos`.`ingredientes`, `produtos`.`imagem`, `categorias`.`id` AS `categoria_id`, `categorias`.`nome` AS `categoria`, `categorias`.`slug` AS `categoria_slug`, MIN(`produtos_especificacoes`.`preco`) AS `preco`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
JOIN `produtos_especificacoes` ON `produtos_especificacoes`.`produto_id` = `produtos`.`id`
WHERE `produtos`.`ativo` = 1
AND `produtos`.`deletado_em` IS NULL
GROUP BY `produtos`.`nome`
ORDER BY `categorias`.`nome` ASC
---
    public function buscaProdutosWebHome(){

        return $this->select([
            'produtos.id',
            'produtos.nome',
            'produtos.slug',
            'produtos.ingredientes',
            'produtos.imagem',
            'categorias.id AS categoria_id',
            'categorias.nome AS categoria',
            'categorias.slug AS categoria_slug',

        ])
                ->selectMin('produtos_especificacoes.preco')
                ->join('categorias', 'categorias.id = produtos.categoria_id')
                ->join('produtos_especificacoes', 'produtos_especificacoes.produto_id = produtos.id')
                ->where('produtos.ativo', true)
                ->groupBy('produtos.nome')
                ->orderBy('categorias.nome', 'ASC')
                ->findAll();